index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-15 Tue 20:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Saving for Retirement</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Matt Brigida, Ph.D." />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Saving for Retirement</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf9699cb">1. Annuity Retirement Model</a>
<ul>
<li><a href="#orge7f7986">1.1. Future Value</a>
<ul>
<li><a href="#org5023787">1.1.1. Using an Annuity Formula</a></li>
<li><a href="#orgc4e4caa">1.1.2. Future Value of Each Cash Flow</a></li>
</ul>
</li>
<li><a href="#orge948b07">1.2. Interactive App</a></li>
<li><a href="#orgbcdb580">1.3. Solving for the Number of Periods</a>
<ul>
<li><a href="#orgbb8777b">1.3.1. Using the FV Annuity Formula</a></li>
</ul>
</li>
<li><a href="#org8858d28">1.4. Solving for r</a></li>
</ul>
</li>
<li><a href="#org4101cd1">2. Growing Annuity Retirement Model</a></li>
<li><a href="#orgf1ed63f">3. Credits and Collaboration</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgf9699cb" class="outline-2">
<h2 id="orgf9699cb"><span class="section-number-2">1</span> Annuity Retirement Model</h2>
<div class="outline-text-2" id="text-1">
<p>
Say as your retirement plan you intend to put $5000 per year, for the next 20 years, into a retirement account.  Further, you expect this account to earn 8% per year.  In this case your savings plan is in the form of an <b>annuity</b>.
</p>

<blockquote>
<p>
Annuity: a security with a fixed cash flow every period for a fixed number of periods.
</p>
</blockquote>

<p>
In your retirement plan $5000 is the fixed cash flow, the period is yearly, and the number of periods is 20.  
</p>
</div>

<div id="outline-container-orge7f7986" class="outline-3">
<h3 id="orge7f7986"><span class="section-number-3">1.1</span> Future Value</h3>
<div class="outline-text-3" id="text-1-1">
<p>
To calculate how much we'll have in our retirement account we can (1) use a convenient annuity formula, or (2) find the future value of each individual cash flow and sum these future values.
</p>
</div>

<div id="outline-container-org5023787" class="outline-4">
<h4 id="org5023787"><span class="section-number-4">1.1.1</span> Using an Annuity Formula</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
We can calculate how much money you will have in your account at the end of year 20 with the following <i>future value of an annuity</i> formula:
</p>

<p>
\(FVA = C\left(\frac{(1 + r)^n - 1}{r}\right)\)
</p>

<p>
where <i>FVA</i> denotes the future value of the annuity, <i>C</i> is the cash flow per period, <i>r</i> is the interest rate per period, and <i>n</i> is the number of periods.
</p>

<p>
Using this formula you can calculate how much money you will have in 20 years:
</p>

<p>
\(FVA = 5000\left(\frac{(1 + 0.08)^20 - 1}{0.08}\right) = 228809.8\)
</p>

<p>
So you will have $228,809.90 in your retirement account in 20 years.
</p>
</div>
</div>

<div id="outline-container-orgc4e4caa" class="outline-4">
<h4 id="orgc4e4caa"><span class="section-number-4">1.1.2</span> Future Value of Each Cash Flow</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Annuity formulas were much more useful prior to widespread use of spreadsheets and programming languages.  
</p>
</div>

<ol class="org-ol">
<li><a id="org6253361"></a>Spreadsheet<br />
<div class="outline-text-5" id="text-1-1-2-1">
<p>
The following table shows how you can organize a spreadsheet to find the future value of the annuity.  The formula in the future value column is:
</p>

<p>
\(FV = C(1 + r)^{(20 - t)}\)
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Time (t)</th>
<th scope="col" class="org-right">Cash Flow (cf)</th>
<th scope="col" class="org-right">Interest Rate (r)</th>
<th scope="col" class="org-right">FV @ year 20</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-right">5000</td>
<td class="org-right">0.08</td>
<td class="org-right">21578.505</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-right">5000</td>
<td class="org-right">0.08</td>
<td class="org-right">19980.097</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-right">5000</td>
<td class="org-right">0.08</td>
<td class="org-right">18500.090</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-right">5000</td>
<td class="org-right">0.08</td>
<td class="org-right">17129.713</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-right">5000</td>
<td class="org-right">0.08</td>
<td class="org-right">15860.846</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-right">5000</td>
<td class="org-right">0.08</td>
<td class="org-right">14685.968</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-right">5000</td>
<td class="org-right">0.08</td>
<td class="org-right">13598.119</td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-right">5000</td>
<td class="org-right">0.08</td>
<td class="org-right">12590.851</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-right">5000</td>
<td class="org-right">0.08</td>
<td class="org-right">11658.195</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-right">5000</td>
<td class="org-right">0.08</td>
<td class="org-right">10794.625</td>
</tr>

<tr>
<td class="org-right">11</td>
<td class="org-right">5000</td>
<td class="org-right">0.08</td>
<td class="org-right">9995.0231</td>
</tr>

<tr>
<td class="org-right">12</td>
<td class="org-right">5000</td>
<td class="org-right">0.08</td>
<td class="org-right">9254.6511</td>
</tr>

<tr>
<td class="org-right">13</td>
<td class="org-right">5000</td>
<td class="org-right">0.08</td>
<td class="org-right">8569.1213</td>
</tr>

<tr>
<td class="org-right">14</td>
<td class="org-right">5000</td>
<td class="org-right">0.08</td>
<td class="org-right">7934.3716</td>
</tr>

<tr>
<td class="org-right">15</td>
<td class="org-right">5000</td>
<td class="org-right">0.08</td>
<td class="org-right">7346.6404</td>
</tr>

<tr>
<td class="org-right">16</td>
<td class="org-right">5000</td>
<td class="org-right">0.08</td>
<td class="org-right">6802.4448</td>
</tr>

<tr>
<td class="org-right">17</td>
<td class="org-right">5000</td>
<td class="org-right">0.08</td>
<td class="org-right">6298.56</td>
</tr>

<tr>
<td class="org-right">18</td>
<td class="org-right">5000</td>
<td class="org-right">0.08</td>
<td class="org-right">5832.</td>
</tr>

<tr>
<td class="org-right">19</td>
<td class="org-right">5000</td>
<td class="org-right">0.08</td>
<td class="org-right">5400.</td>
</tr>

<tr>
<td class="org-right">20</td>
<td class="org-right">5000</td>
<td class="org-right">0.08</td>
<td class="org-right">5000.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">FVA  =</td>
<td class="org-right">228809.82</td>
</tr>
</tbody>
</table>
</div>
</li>

<li><a id="org2033542"></a>Loop<br />
<div class="outline-text-5" id="text-1-1-2-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #8787d7;">cf</span> = 5000
<span style="color: #8787d7;">r</span> = 0.08
<span style="color: #8787d7;">n</span> = 20

<span style="color: #8787d7;">fva</span> = 0
<span style="color: #268bd2; font-weight: bold;">for</span> n <span style="color: #268bd2; font-weight: bold;">in</span> <span style="color: #268bd2;">range</span><span style="color: #268bd2;">(</span>n<span style="color: #268bd2;">)</span>:
<span style="background-color: #262626;"> </span>   <span style="color: #8787d7;">fva</span> += cf * <span style="color: #268bd2;">(</span>1 + r<span style="color: #268bd2;">)</span>**<span style="color: #268bd2;">(</span>n<span style="color: #268bd2;">)</span>

<span style="color: #268bd2; font-weight: bold;">return</span> fva
</pre>
</div>

<pre class="example">
228809.82149058158

</pre>

<p>
Note range(n) gives you 0, 1, &#x2026; , n-1 which is happily what we want.
</p>
</div>
</li>

<li><a id="orgbd39de3"></a>Recursive<br />
<div class="outline-text-5" id="text-1-1-2-3">
<p>
Here is a functional programming approach implemented in python&#x2014;it uses recursion instead of the imperative style loop. It is nice because it doesn't rely on changing variables' state, which can lead to errors.  Don't worry if it doesn't make sense at this point.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #268bd2; font-weight: bold;">def</span> <span style="color: #d75fd7; font-weight: bold;">fva</span><span style="color: #268bd2;">(</span>cf, r, n<span style="color: #268bd2;">)</span>:
<span style="background-color: #262626;"> </span>   <span style="color: #268bd2; font-weight: bold;">if</span> n - 1 == 0:
        <span style="color: #268bd2; font-weight: bold;">return</span> cf
<span style="background-color: #262626;"> </span>   <span style="color: #268bd2; font-weight: bold;">else</span>:
        <span style="color: #268bd2; font-weight: bold;">return</span> cf * <span style="color: #268bd2;">(</span>1 + r<span style="color: #268bd2;">)</span>**<span style="color: #268bd2;">(</span>n - 1<span style="color: #268bd2;">)</span> + fva<span style="color: #268bd2;">(</span>cf, r, n - 1<span style="color: #268bd2;">)</span>

<span style="color: #268bd2; font-weight: bold;">return</span> fva<span style="color: #268bd2;">(</span>5000, 0.08, 20<span style="color: #268bd2;">)</span>
</pre>
</div>

<pre class="example">
228809.82149058158

</pre>

<p>
Same approach in R.  
</p>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #d75fd7; font-weight: bold;">fva</span> <span style="color: #df005f; font-weight: bold;">&lt;-</span> <span style="color: #268bd2; font-weight: bold;">function</span><span style="color: #268bd2;">(</span>cf, r, n<span style="color: #268bd2;">){</span>
    <span style="color: #268bd2; font-weight: bold;">if</span><span style="color: #d75fd7;">(</span>n - 1 == 0<span style="color: #d75fd7;">){</span>
        cf
    <span style="color: #d75fd7;">}</span> <span style="color: #268bd2; font-weight: bold;">else</span> <span style="color: #d75fd7;">{</span>
        cf * <span style="color: #2aa198;">(</span>1 + r<span style="color: #2aa198;">)</span>^<span style="color: #2aa198;">(</span>n - 1<span style="color: #2aa198;">)</span> + fva<span style="color: #2aa198;">(</span>cf, r, n - 1<span style="color: #2aa198;">)</span>
    <span style="color: #d75fd7;">}</span>
<span style="color: #268bd2;">}</span>

fva<span style="color: #268bd2;">(</span>5000, 0.08, 20<span style="color: #268bd2;">)</span>
</pre>
</div>

<pre class="example">
228809.821490582

</pre>
</div>
</li>
</ol>
</div>
</div>



<div id="outline-container-orge948b07" class="outline-3">
<h3 id="orge948b07"><span class="section-number-3">1.2</span> Interactive App</h3>
<div class="outline-text-3" id="text-1-2">
<p>
The following app will calculate OCF for any company you choose.  
</p>

<ul class="org-ul">
<li>Note how different OCF can be from Net Income.</li>
</ul>



  <style>
   .slidecontainer {
  width: 100%; /* Width of the outside container */
}

/* The slider itself */
.slider {
  -webkit-appearance: none;  /* Override default CSS styles */
  appearance: none;
  width: 100%; /* Full-width */
  height: 25px; /* Specified height */
  background: #d3d3d3; /* Grey background */
  outline: none; /* Remove outline */
  opacity: 0.7; /* Set transparency (for mouse-over effects on hover) */
  -webkit-transition: .2s; /* 0.2 seconds transition on hover */
  transition: opacity .2s;
}

/* Mouse-over effects */
.slider:hover {
  opacity: 1; /* Fully shown on mouse-over */
}

/* The slider handle (use -webkit- (Chrome, Opera, Safari, Edge) and -moz- (Firefox) to override default look) */
.slider::-webkit-slider-thumb {
  -webkit-appearance: none; /* Override default look */
  appearance: none;
  width: 25px; /* Set a specific slider handle width */
  height: 25px; /* Slider handle height */
  background: #4CAF50; /* Green background */
  cursor: pointer; /* Cursor on hover */
}

.slider::-moz-range-thumb {
  width: 25px; /* Set a specific slider handle width */
  height: 25px; /* Slider handle height */
  background: #4CAF50; /* Green background */
  cursor: pointer; /* Cursor on hover */
} 

table {
  font-family: arial, sans-serif;
  border-collapse: collapse;
  width: 100%;
}

td, th {
  border: 1px solid #dddddd;
  text-align: left;
  padding: 8px;
}

tr:nth-child(even) {
  background-color: #dddddd;
}
  </style>



  <center><h2>Future Value of an Annuity Calculator:</h2></center>
<div class="slidecontainer">
  <input type="range" min="100" max="10000" value="5000" class="slider" id="cf" step="100">
  <p align="center"><b>Cash Flow: <span id="cf_out"></b></span></p>  
  <input type="range" min="0.00" max="100.00" value="50" class="slider" id="r">
  <p align="center"><b>Interest Rate per Period: <span id="r_out">%</b></span></p>  
  <input type="range" min="1" max="25" value="5" class="slider" id="n">
  <p align="center"><b>Number of Periods: <span id="n_out"></b></span></p>  
</div>

<center><button onclick="myJsFunction()">Calculate</button></center>
<br>
<br>
<center>
The <b>future value of the annuity is $<span id="fva"></span></b>
</center>
<br>
<br>
<hr>
<!---
<center>
<br>
<table>
  <tr>
    <th>Cash Flow</th>
    <th><span id="cf_table"></span></th>
  </tr>
  <tr>
    <th>Interest Rate</th>
    <th><span id="r_table"></span></th>
  </tr>
  <tr>
    <th>Number of Periods</th>
    <th><span id="n_table"></span></th>
  </tr>
  <tr>
    <th>Future Value of the Annuity</th>
    <th><span id="fva"></span></th>
  </tr>
</table>
</center>
-->
    <script src="src/app1.js"></script>
</div>
</div>


<div id="outline-container-orgbcdb580" class="outline-3">
<h3 id="orgbcdb580"><span class="section-number-3">1.3</span> Solving for the Number of Periods</h3>
<div class="outline-text-3" id="text-1-3">
<p>
You may also want to know how long you have to save for retirement until you hit a particular goal amount.  
</p>
</div>

<div id="outline-container-orgbb8777b" class="outline-4">
<h4 id="orgbb8777b"><span class="section-number-4">1.3.1</span> Using the FV Annuity Formula</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
We can rearrange our future value of an annuity formula for n:
</p>

<p>
\(FVA = C\left(\frac{(1 + r)^n - 1}{r}\right)\)
</p>

<p>
becomes:
</p>

<p>
\((1 + r)^n = \frac{FVA(r)}{C} + 1 = \frac{FVA(r) + C}{C}\)
</p>

<p>
and taking logs:
</p>

<p>
\(n = \frac{ln\left(\frac{FVA(r) + C}{C}\right)}{ln(1 + r)}\)
</p>

<p>
So, say we wanted to have $400,000 in our account at retirement.  Then we have to save for:
</p>

<p>
\(n = \frac{ln\left(\frac{400,000(0.08) + 5000}{5000}\right)}{ln(1 + 0.08)} = 26\ years\)
</p>
</div>
</div>
</div>


<div id="outline-container-org8858d28" class="outline-3">
<h3 id="org8858d28"><span class="section-number-3">1.4</span> Solving for r</h3>
</div>
</div>


<div id="outline-container-org4101cd1" class="outline-2">
<h2 id="org4101cd1"><span class="section-number-2">2</span> Growing Annuity Retirement Model</h2>
<div class="outline-text-2" id="text-2">
<p>
A possibly unrealistic feature of using an annuity to model your retirement savings is its assumption that you make constant retirement payments. It is more likely that you will increase your payments over time as your salary increases. In this case we can calculate your retirement savings using the future value of a <b>Growing Annuity</b>.  The formula is:
</p>
</div>
</div>





<div id="outline-container-orgf1ed63f" class="outline-2">
<h2 id="orgf1ed63f"><span class="section-number-2">3</span> Credits and Collaboration</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="https://github.com/financial-education/operating_cash_flow">The code is here and pull requests are welcome.</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Matt Brigida, Ph.D.</p>
<p class="date">Created: 2020-09-15 Tue 20:12</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
